bitcraze/crazyflie-firmware/src/lib/STM32_CPAL_Driver/devices/stm32l1xx/cpal_i2c_hal_stm32l1xx.h
/*========= I2C1 specific defines (GPIO, PINs, Clocks and DMA) =========*/   
  
#define CPAL_I2C1_CLK                   RCC_APB1Periph_I2C1
#define CPAL_I2C1_DR                    ((uint32_t)0x40005410)
#define CPAL_I2C1_AF                    GPIO_AF_I2C1  
  
#define CPAL_I2C1_DMA                   DMA1
#define CPAL_I2C1_DMA_CLK               RCC_AHBPeriph_DMA1 
   
#define CPAL_I2C1_IT_EVT_IRQn           I2C1_EV_IRQn  
#define CPAL_I2C1_IT_ERR_IRQn           I2C1_ER_IRQn   
  
#define CPAL_I2C1_DMA_TX_IRQn           DMA1_Channel6_IRQn
#define CPAL_I2C1_DMA_RX_IRQn           DMA1_Channel7_IRQn
  
#define CPAL_I2C1_DMA_TX_IRQHandler     DMA1_Channel6_IRQHandler
#define CPAL_I2C1_DMA_RX_IRQHandler     DMA1_Channel7_IRQHandler
  
#define CPAL_I2C1_DMA_TX_TC_FLAG        DMA1_FLAG_TC6
#define CPAL_I2C1_DMA_TX_HT_FLAG        DMA1_FLAG_HT6
#define CPAL_I2C1_DMA_TX_TE_FLAG        DMA1_FLAG_TE6
  
#define CPAL_I2C1_DMA_RX_TC_FLAG        DMA1_FLAG_TC7
#define CPAL_I2C1_DMA_RX_HT_FLAG        DMA1_FLAG_HT7
#define CPAL_I2C1_DMA_RX_TE_FLAG        DMA1_FLAG_TE7
  
/*========= I2C2 specific defines (GPIO, PINs, Clocks and DMA) =========*/   
  
#define CPAL_I2C2_CLK                   RCC_APB1Periph_I2C2
#define CPAL_I2C2_DR                    ((uint32_t)0x40005810)
#define CPAL_I2C2_AF                    GPIO_AF_I2C2  
  
#define CPAL_I2C2_DMA                   DMA1
#define CPAL_I2C2_DMA_CLK               RCC_AHBPeriph_DMA1 
    
#define CPAL_I2C2_IT_EVT_IRQn           I2C2_EV_IRQn  
#define CPAL_I2C2_IT_ERR_IRQn           I2C2_ER_IRQn   
#define CPAL_I2C2_DMA_TX_IRQn           DMA1_Channel4_IRQn
#define CPAL_I2C2_DMA_RX_IRQn           DMA1_Channel5_IRQn
  
#define CPAL_I2C2_DMA_TX_IRQHandler     DMA1_Channel4_IRQHandler
#define CPAL_I2C2_DMA_RX_IRQHandler     DMA1_Channel5_IRQHandler

#define CPAL_I2C2_DMA_TX_TC_FLAG        DMA1_FLAG_TC4
#define CPAL_I2C2_DMA_TX_HT_FLAG        DMA1_FLAG_HT4
#define CPAL_I2C2_DMA_TX_TE_FLAG        DMA1_FLAG_TE4

#define CPAL_I2C2_DMA_RX_TC_FLAG        DMA1_FLAG_TC5
#define CPAL_I2C2_DMA_RX_HT_FLAG        DMA1_FLAG_HT5
#define CPAL_I2C2_DMA_RX_TE_FLAG        DMA1_FLAG_TE5 
  

/* Exported macro ------------------------------------------------------------*/  

/*========= Peripheral Clock Command =========*/

#define __I2C_CLK_CMD(clk,cmd)                   RCC_APB1PeriphClockCmd((clk),(cmd))

#define __I2C_RCC_RESET(clk)                     RCC_APB1PeriphResetCmd((clk),ENABLE);\
                                                 RCC_APB1PeriphResetCmd((clk),DISABLE)  

  
#define __I2C_GPIO_CLK_CMD(clk,cmd)              RCC_AHBPeriphClockCmd((clk),(cmd))
    
#define __DMA_CLK_CMD(clk,cmd)                   RCC_AHBPeriphClockCmd((clk),(cmd))

#define __DMA_RESET_CMD(clk,cmd)                 RCC_AHBPeriphResetCmd((clk),(cmd)) 
  
  
/*========= DMA =========*/
  
/* DMA channels enable/disable */  

#define __CPAL_I2C_HAL_ENABLE_DMATX(device)      CPAL_I2C_DMA_TX_Channel[(device)]->CCR |= DMA_CCR_EN  
  
#define __CPAL_I2C_HAL_DISABLE_DMATX(device)     CPAL_I2C_DMA_TX_Channel[(device)]->CCR &= ~DMA_CCR_EN 
  
#define __CPAL_I2C_HAL_ENABLE_DMARX(device)      CPAL_I2C_DMA_RX_Channel[(device)]->CCR |= DMA_CCR_EN  

#define __CPAL_I2C_HAL_DISABLE_DMARX(device)     CPAL_I2C_DMA_RX_Channel[(device)]->CCR &= ~DMA_CCR_EN

/* DMA interrupts enable/disable */  

#define __I2C_HAL_ENABLE_DMATX_TCIT(device)      CPAL_I2C_DMA_TX_Channel[(device)]->CCR |= DMA_IT_TC
  
#define __I2C_HAL_ENABLE_DMATX_HTIT(device)      CPAL_I2C_DMA_TX_Channel[(device)]->CCR |= DMA_IT_HT
  
#define __I2C_HAL_ENABLE_DMATX_TEIT(device)      CPAL_I2C_DMA_TX_Channel[(device)]->CCR |= DMA_IT_TE
  
#define __I2C_HAL_ENABLE_DMARX_TCIT(device)      CPAL_I2C_DMA_RX_Channel[(device)]->CCR |= DMA_IT_TC
  
#define __I2C_HAL_ENABLE_DMARX_HTIT(device)      CPAL_I2C_DMA_RX_Channel[(device)]->CCR |= DMA_IT_HT
  
#define __I2C_HAL_ENABLE_DMARX_TEIT(device)      CPAL_I2C_DMA_RX_Channel[(device)]->CCR |= DMA_IT_TE
  
/* DMA interrupts flag management */

#define __CPAL_I2C_HAL_GET_DMATX_TCIT(device)    (uint32_t)(CPAL_I2C_DMA[(device)]->ISR & CPAL_I2C_DMA_TX_TC_FLAG [(device)])

#define __CPAL_I2C_HAL_GET_DMATX_HTIT(device)    (uint32_t)(CPAL_I2C_DMA[(device)]->ISR & CPAL_I2C_DMA_TX_HT_FLAG [(device)])

#define __CPAL_I2C_HAL_GET_DMATX_TEIT(device)    (uint32_t)(CPAL_I2C_DMA[(device)]->ISR & CPAL_I2C_DMA_TX_TE_FLAG [(device)])

#define __CPAL_I2C_HAL_GET_DMARX_TCIT(device)    (uint32_t)(CPAL_I2C_DMA[(device)]->ISR & CPAL_I2C_DMA_RX_TC_FLAG [(device)])

#define __CPAL_I2C_HAL_GET_DMARX_HTIT(device)    (uint32_t)(CPAL_I2C_DMA[(device)]->ISR & CPAL_I2C_DMA_RX_HT_FLAG [(device)])

#define __CPAL_I2C_HAL_GET_DMARX_TEIT(device)    (uint32_t)(CPAL_I2C_DMA[(device)]->ISR & CPAL_I2C_DMA_RX_TE_FLAG [(device)])
  
#define __CPAL_I2C_HAL_CLEAR_DMATX_IT(device)    CPAL_I2C_DMA[(device)]->IFCR = (CPAL_I2C_DMA_TX_TC_FLAG[(device)] \
                                                 | CPAL_I2C_DMA_TX_HT_FLAG[(device)] | CPAL_I2C_DMA_TX_TE_FLAG[(device)]) 

#define __CPAL_I2C_HAL_CLEAR_DMARX_IT(device)    CPAL_I2C_DMA[(device)]->IFCR = (CPAL_I2C_DMA_RX_TC_FLAG[(device)] \
                                                 | CPAL_I2C_DMA_RX_HT_FLAG[(device)] | CPAL_I2C_DMA_RX_TE_FLAG[(device)]) 

/* Get DMA data counter */  

#define __CPAL_I2C_HAL_DMATX_GET_CNDT(device)    (uint32_t)(CPAL_I2C_DMA_TX_Channel[(device)]->CNDTR)
 
#define __CPAL_I2C_HAL_DMARX_GET_CNDT(device)    (uint32_t)(CPAL_I2C_DMA_RX_Channel[(device)]->CNDTR) 
 

/*========= I2C =========*/  
  
/* I2C enable/disable */  

#define __CPAL_I2C_HAL_ENABLE_DEV(device)        CPAL_I2C_DEVICE[(device)]->CR1 |= I2C_CR1_PE  
  
#define __CPAL_I2C_HAL_DISABLE_DEV(device)       CPAL_I2C_DEVICE[(device)]->CR1 &= ~I2C_CR1_PE  
     
/* I2C software reset */

#define __CPAL_I2C_HAL_SWRST(device)             CPAL_I2C_DEVICE[(device)]->CR1 |= I2C_CR1_SWRST; \
                                                 CPAL_I2C_DEVICE[(device)]->CR1 &= ~I2C_CR1_SWRST     
  
